```
Error: [ERROR] terraform-provider-alicloud/alicloud/resource_alicloud_cs_managed_kubernetes.go:323: Resource alicloud_cs_managed_kubernetes CreateKubernetesCluster Failed!!! [SDK denverdino/aliyungo ERROR]:
Aliyun API Error: RequestId: 4389C9D6-F20D-49E0-B305-59183AE42C70 Status Code: 400 Code: ZoneNotSupported Message: The current zone  does not support creating SLB, please try other zones
```

```
  # module.aliyun.alicloud_cs_managed_kubernetes.k8s will be created
  + resource "alicloud_cs_managed_kubernetes" "k8s" {
      + availability_zone           = "cn-beijing-a"
      + client_cert                 = "~/.kube/aliyun/client-cert.pem"
      + client_key                  = "~/.kube/aliyun/client-key.pem"
      + cluster_ca_cert             = "~/.kube/aliyun/cluster-ca-cert.pem"
      + force_update                = false
      + id                          = (known after apply)
      + install_cloud_monitor       = true
      + kube_config                 = "~/.kube/config"
      + name                        = "sumi"
      + name_prefix                 = "Terraform-Creation"
      + new_nat_gateway             = true
      + password                    = (sensitive value)
      + pod_cidr                    = "172.20.0.0/16"
      + security_group_id           = (known after apply)
      + service_cidr                = "172.21.0.0/20"
      + slb_internet_enabled        = true
      + vpc_id                      = (known after apply)
      + worker_disk_category        = "cloud_efficiency"
      + worker_disk_size            = 40
      + worker_instance_charge_type = "PostPaid"
      + worker_instance_types       = [
          + "ecs.n1.small",
        ]
      + worker_nodes                = (known after apply)
      + worker_number               = 2
    }
```